<<<<<<< HEAD
#  Вывсти квадрат числа.


#a = int(input())
#print(a**2)


# Напишите программу, которая принимает два числа на вход и проверяет, является ли одно число квадратом другого

# a = int(input())
# b = int(input())

# if a == b**2 or b == a**2:
#     print(f'Является')
# else:
#     print(f'Не является')



a = int(input())
max = a
for i in range(4):
    b=int(input())
    if b > max:
        max = b
print(max)

=======
#  Вывсти квадрат числа.


#a = int(input())
#print(a**2)


# Напишите программу, которая принимает два числа на вход и проверяет, является ли одно число квадратом другого

# a = int(input())
# b = int(input())

# if a == b**2 or b == a**2:
#     print(f'Является')
# else:
#     print(f'Не является')



a = int(input())
max = a
for i in range(4):
    b=int(input())
    if b > max:
        max = b
print(max)

>>>>>>> 38d518edd7576fa256c250883a17b84c37e7a701
